app/controllers/cms_admin/galleries_controller.rb

INSERT INTO "galleries" ("thumbnail_width", "description", "full_size_width", "full_size_height", "crop_full_size", "updated_at", "slug", "title", "created_at") VALUES (100, 'Lorem ipsum dolor sit amet, consectetur adipisicing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua. Ut enim ad minim veniam, quis nostrud exercitation', 800, 400, NULL, '2011-05-26 03:29:20.080580', 'new-gallery', 'New Gallery', '2011-05-26 03:29:20.080580')
---
  def create
    @gallery.save!

UPDATE "galleries" SET "updated_at" = '2011-05-26 03:29:20.240064', "title" = 'New Title' WHERE ("galleries"."id" = 593363170)
---
  def update
    @gallery.update_attributes!(params[:gallery])

DELETE FROM "galleries" WHERE ("galleries"."id" = 593363170)
---
  def destroy
    @gallery.destroy

SELECT "galleries".* FROM "galleries" WHERE ("galleries"."id" = 593363170) LIMIT 1
---
  def load_gallery
    @gallery = Gallery.find(params[:id])