app/controllers/cms_admin/photos_controller.rb

SELECT "photos".* FROM "photos" WHERE ("photos".gallery_id = 593363170) ORDER BY position
---
  def index
    @photos = @gallery.photos.all

INSERT INTO "photos" ("image_file_size", "image_file_name", "slug", "url", "title", "description", "updated_at", "created_at", "image_content_type", "gallery_id", "position") VALUES (5774, 'test_image.jpg', NULL, NULL, NULL, 'New Description', '2011-05-26 04:22:22.422623', '2011-05-26 04:22:22.422623', 'image/jpeg', 593363170, 0)
---
  def create
    p 'AAAAA', @photo

    @photo = @gallery.photos.create!(:image => params[:file])

UPDATE "photos" SET "updated_at" = '2011-05-26 03:26:31.300784', "image_file_name" = 'test_image.jpg', "image_content_type" = 'image/jpeg', "image_file_size" = 5774, "description" = 'Updated Description' WHERE ("photos"."id" = 593363170)
---
  def update
    @photo.update_attributes!(params[:photo])

DELETE FROM "photos" WHERE ("photos"."id" = 593363170)
---
  def destroy
    @photo.destroy

SELECT "galleries".* FROM "galleries" WHERE ("galleries"."id" = 593363170) LIMIT 1
---
  def load_gallery
    @gallery = Gallery.find(params[:gallery_id])

SELECT "photos".* FROM "photos" WHERE ("photos".gallery_id = 593363170) AND ("photos"."id" = 593363170) ORDER BY position LIMIT 1
---
  def load_photo
    @photo = @gallery.photos.find(params[:id])