app/controllers/photos_controller.rb

SELECT "photos".* FROM "photos" WHERE ("photos"."id" = 593363170) ORDER BY position LIMIT 1
---
  def load_photo
    @photo = Photo.find(params[:id])